<b>Assign value to a variable</b>

In [1]:
a = 1
b = 2

<b>Print sum of two variables (a and b)</b>

In [2]:
a_b_sum = a + b
print(a_b_sum)

<b>Import pandas library</b>

In [3]:
import pandas as pd

<b>Create dataframe</b>

In [4]:
Cars = {'Brand': ['Honda Civic','Toyota Corolla','Ford Focus','Audi A4', 'Audi A5'],
        'Price': [22000,25000,27000,35000,40000],
        'Vat': [0.23, 0.23, 0.23, 0.23, 0.23]
       }
df = pd.DataFrame(Cars, columns = ['Brand', 'Price'])

<b>Use info() method on a dataframe</b>

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
Brand    5 non-null object
Price    5 non-null int64
dtypes: int64(1), object(1)
memory usage: 124.0+ bytes

<b>Count all records in a dataframe</b>

In [6]:
len(df.index)

5

<b>Display first four records in a dataframe</b>

In [7]:
df[: 4]

            Brand  Price
0     Honda Civic  22000
1  Toyota Corolla  25000
2      Ford Focus  27000
3         Audi A4  35000

<b>Calculate mean value of a Price column values</b>

In [8]:
df['Price'].mean()

29800.0

<b>Calculate median value of a Price column values</b>

In [9]:
df['Price'].median()

27000.0

<b>Find maximum value in a Price column values</b>

In [10]:
df['Price'].max()

40000

<b>Find minimum value in a Price column values</b>

In [11]:
df['Price'].min()

22000

<b>Alternative way to calculate mean, median, maximum and minimum value in a whole dataset (as well as number of records, standard deviation, first and third quartile)</b>

In [14]:
df['Price'].describe()

count        5.000000
mean     29800.000000
std       7463.243263
min      22000.000000
25%      25000.000000
50%      27000.000000
75%      35000.000000
max      40000.000000
Name: Price, dtype: float64

<b>Import matplotlib library</b>

In [15]:
import matplotlib.pyplot as plt

ModuleNotFoundError: No module named 'matplotlib'

<b>Generate histogram of values in Price column</b>

In [17]:
plt.hist(df['Price'])

NameError: name 'plt' is not defined

<b>Create new column total_price equal to sum of value in Pricece column and multiplication of value in Price and Vat columns</b>

In [22]:
df['total_price'] = df['Price'] + df['Price'] * Cars['Vat']
df

            Brand  Price  total_price
0     Honda Civic  22000      27060.0
1  Toyota Corolla  25000      30750.0
2      Ford Focus  27000      33210.0
3         Audi A4  35000      43050.0
4         Audi A5  40000      49200.0

<b>Create new dataframe containing data about cars more expensive than 27000</b>

In [28]:
expensive_cars = df.loc[df['Price'] > 27000]
expensive_cars

     Brand  Price  total_price
3  Audi A4  35000      43050.0
4  Audi A5  40000      49200.0

In [31]:
expensive_cars = df.loc[df['total_price'] > 27000]
expensive_cars

            Brand  Price  total_price
0     Honda Civic  22000      27060.0
1  Toyota Corolla  25000      30750.0
2      Ford Focus  27000      33210.0
3         Audi A4  35000      43050.0
4         Audi A5  40000      49200.0

<b>Select two sets of random records from a dataframe</b>

In [34]:
first_random_dataframe = df.sample(3)
second_random_dataframe = df.sample(3)

In [36]:
first_random_dataframe

            Brand  Price  total_price
1  Toyota Corolla  25000      30750.0
4         Audi A5  40000      49200.0
3         Audi A4  35000      43050.0

In [37]:
second_random_dataframe

            Brand  Price  total_price
3         Audi A4  35000      43050.0
1  Toyota Corolla  25000      30750.0
0     Honda Civic  22000      27060.0

<b>Create histograms for both of random dataframes</b>

<b>Create box plots for both of random dataframes</b>